BryLoo/STM32CubeIDE/workspace_1.18.0/A_3/Core/Src/main.c
/*******************************************************************************
* EE 329 A3 KEYPAD INTERFACE
*******************************************************************************
* @file : main.c
* @brief : operation of LCD w/ timer countdown & integration w/ keypad & LED
* project : EE 329 S'25 Assignment 3
* authors : Jesus Martinez, Bryan Lew
* version : 1
* date : 4/23/25
* compiler : STM32CubeIDE v.1.18.0
* target : NUCLEO-L4A6ZG
* clocks : 4 MHz MSI to AHB2
* pinouts:
CN8 → GPIO Port E → PIN 2 → LCD Pin 4 → RS
CN8 → GPIO Port E → PIN 3 → LCD Pin 5 → R/W
CN8 → GPIO Port E → PIN 4 → LCD Pin 6 → EN
CN8 → GPIO Port E → PIN 5 → LCD Pin 11 → Lower bit 0
CN8 → GPIO Port E → PIN 6 → LCD Pin 12 → Lower bit 1
CN8 → GPIO Port E → PIN 7 → LCD Pin 13 → Lower bit 2
CN8 → GPIO Port E → PIN 8 → LCD Pin 14 → Lower bit 3

CN8 → GPIO Port C → PIN 0 → LED

CN9 → GPIO Port D → PIN 0 → ROW 1
CN9 → GPIO Port D → PIN 1 → ROW 2
CN9 → GPIO Port D → PIN 3 → KEYPAD → ROW 3
CN9 → GPIO Port D → PIN 4 → KEYPAD → ROW 4
CN9 → GPIO Port D → PIN 5 → KEYPAD → COLUMN 1
CN9 → GPIO Port D → PIN 6 → KEYPAD → COLUMN 2
CN9 → GPIO Port D → PIN 7 → KEYPAD →  COLUMN 3
*
* plan:
* 1) read datasheets
* 2) create wiring diagram
* 3) create flowchart
* 4) assemble hardware
* 5) configure LCD
* 6) initialize SysTick & delay functions
* 7) write counter program
* 8) initialize functions in main
* 9) test all cases on hardware
* 10) check timing accuracy for 3 trials
* 11) record video
* 12) format code
* @attention : (c) 2025 STMicroelectronics. All rights reserved.
*******************************************************************************
. . .
* 45678-1-2345678-2-2345678-3-2345678-4-2345678-5-2345678-6-2345678-7-234567 */

#include "main.h"
#include "stm32l4xx.h"
#include "stdio.h"
#include "delay.h"
#include "lcd.h"
#include "keypad.h"

int minutes = 0;
int seconds = 10;
char time_buffer[6];

int countdown_start = 0;

char input_buffer[5] = { 0 };
int input_index = 0;

char lastkey = '\0';

void SystemClock_Config(void);

static void MX_GPIO_Init(void);


int main(void) {

	HAL_Init();

	//initialize LED GPIO
	RCC->AHB2ENR |= RCC_AHB2ENR_GPIOCEN; //enable clock for GPIO C
	GPIOC->MODER &= ~(GPIO_MODER_MODE0); //clear mode of pins
	GPIOC->MODER |= (GPIO_MODER_MODE0_0); //set mode of pins
	GPIOC->OTYPER &= ~(GPIO_OTYPER_OT0); //set output drive
	GPIOC->PUPDR &= ~(GPIO_PUPDR_PUPD0); //set pullup/pull-down resistors
	GPIOC->OSPEEDR |= (3 << GPIO_OSPEEDR_OSPEED0_Pos); //set speed

	RCC->AHB2ENR |= RCC_AHB2ENR_GPIODEN; //enable clock for GPIO D

	SysTick_Init();
	LCD_config();		//enables GPIO pins for LCD
	Keypad_Config();
	LCD_init();		//wake up + 4 bit set
	LCD_command(0x01);
	delay_us(2000);
	LCD_setcursor(0, 0);
	LCD_write_string("EE 329 A3 TIMER");
	LCD_setcursor(1, 0);
	LCD_write_string("*=SET #=GO 00:00");

	//infinite loop to allow code to run more than one time
	while (1) {

		//infinite loop to check if '*' key pressed
		while (1) {
			if (Keypad_IsAnyKeyPressed()) {
				char key = Keypad_WhichKeyIsPressed();
				if (key == '*') {
					break;
				}
			}
		}

		char input_buffer[5] = { 0 }; //create input buffer of size 5; minute 1 [0], minute 2 [1], colon : [2], second 1 [3], second 2 [4]
		int input_index = 0; //create (time) input index starting at 0

		//while input index in range
		while (input_index <= 5) {
			if (Keypad_IsAnyKeyPressed()) {
				char key = Keypad_WhichKeyIsPressed();

				switch (input_index) {
				case 0:
					if (key >= '0' && key <= '5') { //first digit capped in for 59 minutes
						input_buffer[input_index++] = key; //set next index of input buffer to key
						LCD_setcursor(1, 11 + input_index - 1); //set LCD cursor in correct spot before writing
						LCD_write_char(key); //write character
					}
					break;

				case 1:
					if (key >= '0' && key <= '9') { //second digit capped in for 59 minutes
						input_buffer[input_index++] = key; //set next index of input buffer to key
						LCD_setcursor(1, 11 + input_index - 1); //set LCD cursor in correct spot before writing
						LCD_write_char(key); //write character
					}
					continue; //automatically go to write colon (case 2)

				case 2:
					input_buffer[input_index++] = key; //set next index of input buffer to key
					LCD_setcursor(1, 11 + input_index - 1); //set LCD cursor in correct spot before writing
					LCD_write_char(':'); //write character
					break;

				case 3:
					printf("test%d\n", 1);
					if (key >= '0' && key <= '5') { //first digit capped in for 59 seconds
						input_buffer[input_index++] = key; //set next index of input buffer to key
						LCD_setcursor(1, 11 + input_index - 1); //set LCD cursor in correct spot before writing
						LCD_write_char(key); //write character
					}
					break;

				case 4:
					if (key >= '0' && key <= '9') { //second digit capped in for 59 seconds
						input_buffer[input_index++] = key; //set next index of input buffer to key
						LCD_setcursor(1, 11 + input_index - 1); //set LCD cursor in correct spot before writing
						LCD_write_char(key); //write character
						input_buffer[input_index++] = 0;
					}
					break;
				}
			}

			//debounce delay code
			while (Keypad_IsAnyKeyPressed()) {
				delay_us(150000);
			}

		}

		//invinite loop to check if '#' key is pressed
		while (1) {
			if (Keypad_IsAnyKeyPressed()) {
				char key = Keypad_WhichKeyIsPressed();
				if (key == '#')
					break;
			}
		}

		//clock countdown code
		int mm = (input_buffer[0] - '0') * 10 + (input_buffer[1] - '0'); //initialize minutes
		int ss = (input_buffer[3] - '0') * 10 + (input_buffer[4] - '0'); //initialize seconds
		char time_buffer[10]; //create time buffer of size 10

		//while timer is greater than 0 seconds, check to see if '*' key is pressed
		while (mm > 0 || ss > 0) {
			if (Keypad_IsAnyKeyPressed()) {
				char key = Keypad_WhichKeyIsPressed();
				if (key == '*') {
					break;
				}
			}
			snprintf(time_buffer, sizeof(time_buffer), "%02d:%02d", mm, ss); //print current time as string
			LCD_setcursor(1, 11); //set cursor to bottom row of LCD, also set column to first minute digit
			LCD_write_string(time_buffer); //write time string to LCD
			delay_us(1000000); //delay

			if (--ss < 0 || ss > 59) { //if seconds goes below 0, reduce minute by 1 and reset seconds to 59
				ss = 59;
				mm--;
			}

		}

		//once timer finishes to 0
		LCD_setcursor(1, 11); //set cursor to bottom row of LCD, also set column to first minute digit
		LCD_write_string("00:00"); //write 00:00 to LCD
		LED_PORT->ODR |= LED_PIN; //turn on LED

		//infinite loop to check if '#' key has been pressed
		while (1) {
			if (Keypad_IsAnyKeyPressed()) {
				char key = Keypad_WhichKeyIsPressed();
				if (key == '#') {
					LED_PORT->ODR &= ~LED_PIN; //turn off LED if '#' key pressed
					break;

				}
			}
		}

	}
}
/**
 * @brief System Clock Configuration
 * @retval None
 */

//
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
void SystemClock_Config(void) {
	RCC_OscInitTypeDef RCC_OscInitStruct = { 0 };
	RCC_ClkInitTypeDef RCC_ClkInitStruct = { 0 };

	/** Configure the main internal regulator output voltage
	 */
	if (HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1)
			!= HAL_OK) {
		Error_Handler();
	}

	/** Initializes the RCC Oscillators according to the specified parameters
	 * in the RCC_OscInitTypeDef structure.
	 */
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_MSI;
	RCC_OscInitStruct.MSIState = RCC_MSI_ON;
	RCC_OscInitStruct.MSICalibrationValue = 0;
	RCC_OscInitStruct.MSIClockRange = RCC_MSIRANGE_6;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
	if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
		Error_Handler();
	}

	/** Initializes the CPU, AHB and APB buses clocks
	 */
	RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK
			| RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
	RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_MSI;
	RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
	RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
	RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

	if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK) {
		Error_Handler();
	}
}

/**
 * @brief GPIO Initialization Function
 * @param None
 * @retval None
 */
static void MX_GPIO_Init(void) {
	GPIO_InitTypeDef GPIO_InitStruct = { 0 };
	/* USER CODE BEGIN MX_GPIO_Init_1 */

	/* USER CODE END MX_GPIO_Init_1 */

	/* GPIO Ports Clock Enable */
	__HAL_RCC_GPIOC_CLK_ENABLE();
	__HAL_RCC_GPIOH_CLK_ENABLE();
	__HAL_RCC_GPIOB_CLK_ENABLE();
	__HAL_RCC_GPIOG_CLK_ENABLE();
	HAL_PWREx_EnableVddIO2();
	__HAL_RCC_GPIOA_CLK_ENABLE();

	/*Configure GPIO pin Output Level */
	HAL_GPIO_WritePin(GPIOB, LD3_Pin | LD2_Pin, GPIO_PIN_RESET);

	/*Configure GPIO pin Output Level */
	HAL_GPIO_WritePin(USB_PowerSwitchOn_GPIO_Port,
	USB_PowerSwitchOn_Pin, GPIO_PIN_RESET);

	/*Configure GPIO pin : B1_Pin */
	GPIO_InitStruct.Pin = B1_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	HAL_GPIO_Init(B1_GPIO_Port, &GPIO_InitStruct);

	/*Configure GPIO pins : LD3_Pin LD2_Pin */
	GPIO_InitStruct.Pin = LD3_Pin | LD2_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
	HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

	/*Configure GPIO pin : USB_OverCurrent_Pin */
	GPIO_InitStruct.Pin = USB_OverCurrent_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	HAL_GPIO_Init(USB_OverCurrent_GPIO_Port, &GPIO_InitStruct);

	/*Configure GPIO pin : USB_PowerSwitchOn_Pin */
	GPIO_InitStruct.Pin = USB_PowerSwitchOn_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
	HAL_GPIO_Init(USB_PowerSwitchOn_GPIO_Port, &GPIO_InitStruct);

	/*Configure GPIO pins : STLK_RX_Pin STLK_TX_Pin */
	GPIO_InitStruct.Pin = STLK_RX_Pin | STLK_TX_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	GPIO_InitStruct.Alternate = GPIO_AF8_LPUART1;
	HAL_GPIO_Init(GPIOG, &GPIO_InitStruct);

	/*Configure GPIO pins : USB_SOF_Pin USB_ID_Pin USB_DM_Pin USB_DP_Pin */
	GPIO_InitStruct.Pin = USB_SOF_Pin | USB_ID_Pin | USB_DM_Pin | USB_DP_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	GPIO_InitStruct.Alternate = GPIO_AF10_OTG_FS;
	HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

	/* USER CODE BEGIN MX_GPIO_Init_2 */

	/* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */
int _write(int file, char *ptr, int len) {
	(void) file;
	int DataIdx;

	for (DataIdx = 0; DataIdx < len; DataIdx++) {
		ITM_SendChar(*ptr++);
	}
	return len;
}
/* USER CODE END 4 */

/**
 * @brief  This function is executed in case of error occurrence.
 * @retval None
 */
void Error_Handler(void) {
	/* USER CODE BEGIN Error_Handler_Debug */
	/* User can add his own implementation to report the HAL error return state */
	__disable_irq();
	while (1) {
	}
	/* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
